backend/docs/k6/results/read-heavy-without-l2.txt
        cache:
          use_second_level_cache: false
          use_query_cache: false



3rd/backend on  new-try-to-k6 via 🅶 v8.14.3 via ☕ v21.0.9 via 🅺
 19:30:19  ❯ time k6 run docs/k6/scenario.js && time k6 run docs/k6/l2-stats.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: docs/k6/scenario.js
        output: -

     scenarios: (100.00%) 5 scenarios, 9 max VUs, 3m50s max duration (incl. graceful stop):
              * crud_and_import: 2 iterations for each of 5 VUs (maxDuration: 2m0s, exec: crudAndImport, gracefulStop: 30s)
              * conflict_update_delete: 10 iterations for each of 1 VUs (maxDuration: 2m0s, exec: concurrentUpdateDelete, startTime: 5s, gracefulStop: 30s)
              * conflict_delete_delete: 10 iterations for each of 1 VUs (maxDuration: 2m0s, exec: concurrentDeleteDelete, startTime: 10s, gracefulStop: 30s)
              * unique_name_race: 10 iterations for each of 1 VUs (maxDuration: 2m0s, exec: uniqueCreateRace, startTime: 15s, gracefulStop: 30s
              * read_heavy: 1000 iterations for each of 1 VUs (maxDuration: 3m0s, exec: readOnly, startTime: 20s, gracefulStop: 30s)

INFO[0000] initial: {"hits":0,"misses":0}                source=console
INFO[0020] read_only iter 0: {"hits":0,"misses":0}       source=console
INFO[0122] read_only iter 200: {"hits":0,"misses":0}     source=console
INFO[0201] final: {"hits":0,"misses":0}                  source=console


  █ TOTAL RESULTS

    checks_total.......: 509     2.532517/s
    checks_succeeded...: 100.00% 509 out of 509
    checks_failed......: 0.00%   0 out of 509

    ✓ PUT /cache/l2/logging -> 200
    ✓ GET /cache/l2/stats -> 200
    ✓ POST /persons -> 200
    ✓ PUT /persons/{id} -> 200
    ✓ DELETE /persons/{id} -> 200
    ✓ POST /persons/import -> 200
    ✓ POST /location/import -> 200
    ✓ concurrent PUT -> 200/404/409
    ✓ concurrent DELETE -> 200/404
    ✓ after delete person is gone (404)
    ✓ one delete wins, one gets 404
    ✓ exactly one create succeeds
    ✓ cleanup delete -> 200
    ✓ name is available after cleanup
    ✓ GET /persons -> 200

    HTTP
    http_req_duration..............: avg=391.12ms min=2.06ms  med=168.42ms max=1.24s p(90)=945.45ms p(95)=971.34ms
      { expected_response:true }...: avg=408.74ms min=2.06ms  med=170.95ms max=1.24s p(90)=949.22ms p(95)=972.26ms
    http_req_failed................: 6.41%  34 out of 530
    http_reqs......................: 530    2.637002/s

    EXECUTION
    dropped_iterations.............: 637    3.169378/s
    iteration_duration.............: avg=507.97ms min=38.38ms med=481.82ms max=1.48s p(90)=967.3ms  p(95)=1s
    iterations.....................: 403    2.005116/s
    vus............................: 1      min=0         max=5
    vus_max........................: 9      min=9         max=9

    NETWORK
    data_received..................: 1.3 MB 6.3 kB/s
    data_sent......................: 120 kB 595 B/s



running (3m21.0s), 0/9 VUs, 403 complete and 0 interrupted iterations
crud_and_import        ✓ [==================] 5 VUs  0m02.5s/2m0s  10/10 iters, 2 per VU
conflict_update_delete ✓ [==================] 1 VUs  0m04.6s/2m0s  10/10 iters, 10 per VU
conflict_delete_delete ✓ [==================] 1 VUs  0m03.7s/2m0s  10/10 iters, 10 per VU
unique_name_race       ✓ [==================] 1 VUs  0m03.8s/2m0s  10/10 iters, 10 per VU
read_heavy             ✓ [==================] 1 VUs  3m0s          0363/1000 iters, 1000 per VU

________________________________________________________
Executed in  201.45 secs    fish           external
   usr time    1.38 secs    0.29 millis    1.37 secs
   sys time    0.92 secs    2.34 millis    0.91 secs


         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: docs/k6/l2-stats.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations for each of 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)

INFO[0000] initial: {"hits":0,"misses":0}                source=console
INFO[0000] after 1 reads: {"hits":0,"misses":0}          source=console
INFO[0006] after 11 reads: {"hits":0,"misses":0}         source=console
INFO[0012] after 21 reads: {"hits":0,"misses":0}         source=console
INFO[0018] after 31 reads: {"hits":0,"misses":0}         source=console
INFO[0024] after 41 reads: {"hits":0,"misses":0}         source=console
INFO[0030] final: {"hits":0,"misses":0}                  source=console


  █ TOTAL RESULTS

    checks_total.......: 57      1.888017/s
    checks_succeeded...: 100.00% 57 out of 57
    checks_failed......: 0.00%   0 out of 57

    ✓ GET /cache/l2/stats -> 200
    ✓ GET /persons -> 200

    HTTP
    http_req_duration..............: avg=425.67ms min=3.4ms  med=492.27ms max=611.5ms p(90)=532.38ms p(95)=548.05ms
      { expected_response:true }...: avg=425.67ms min=3.4ms  med=492.27ms max=611.5ms p(90)=532.38ms p(95)=548.05ms
    http_req_failed................: 0.00%  0 out of 59
    http_reqs......................: 59     1.954264/s

    EXECUTION
    iteration_duration.............: avg=30.16s   min=30.16s med=30.16s   max=30.16s  p(90)=30.16s   p(95)=30.16s
    iterations.....................: 1      0.033123/s
    vus............................: 1      min=1       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 167 kB 5.5 kB/s
    data_sent......................: 7.5 kB 250 B/s



running (00m30.2s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [======================================] 1 VUs  00m30.2s/10m0s  1/1 iters, 1 per VU

________________________________________________________
Executed in   30.51 secs      fish           external
   usr time  181.20 millis    0.37 millis  180.83 millis
   sys time  155.04 millis    2.69 millis  152.36 millis